mikaelpatel/Cosa/boards.txt
# @file boards.txt
# @version 1.0
#
# @section License
# Copyright (C) 2013-2015, Mikael Patel
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
# 
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
# Lesser General Public License for more details.
# 
# @section Description
# The Cosa Arduino core boards definition file; in alfabetical order. 
# The default setting is the composition of the supported boards.
# See the directory boards.
#
# This file is part of the Arduino Che Cosa project.

##
# ADAFRUIT BOARDS
##

# **** Factory bootloader; CDC auto-reset will not work ****
# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
adafruit-atmega32u4.name=Cosa AdaFruit (ATmega32U4/LUFA+)
adafruit-atmega32u4.upload.tool=avrdude
adafruit-atmega32u4.upload.protocol=avr109
adafruit-atmega32u4.upload.maximum_size=28672
adafruit-atmega32u4.upload.maximum_data_size=2560
adafruit-atmega32u4.upload.maximum_eeprom_size=1024
adafruit-atmega32u4.upload.speed=57600

adafruit-atmega32u4.bootloader.path=caterina
adafruit-atmega32u4.bootloader.tool=avrdude
adafruit-atmega32u4.bootloader.low_fuses=0xff
adafruit-atmega32u4.bootloader.high_fuses=0xd8
adafruit-atmega32u4.bootloader.extended_fuses=0xcb

adafruit-atmega32u4.build.mcu=atmega32u4
adafruit-atmega32u4.build.f_cpu=16000000L
adafruit-atmega32u4.build.vid=0x239A
adafruit-atmega32u4.build.pid=0x8001
adafruit-atmega32u4.build.usb_product="AVR CDC Bootloader"
adafruit-atmega32u4.build.board=ADAFRUIT_ATMEGA32U4
adafruit-atmega32u4.build.variant=adafruit/atmega32u4
adafruit-atmega32u4.build.extra_flags={build.usb_flags}
adafruit-atmega32u4.build.core=cosa

# **** Bootloader replaced with Caterina ****
# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
adafruit-atmega32u4-cat.name=Cosa AdaFruit (ATmega32U4/Caterina)
adafruit-atmega32u4-cat.upload.tool=avrdude
adafruit-atmega32u4-cat.upload.protocol=avr109
adafruit-atmega32u4-cat.upload.maximum_size=28672
adafruit-atmega32u4-cat.upload.maximum_data_size=2560
adafruit-atmega32u4-cat.upload.maximum_eeprom_size=1024
adafruit-atmega32u4-cat.upload.speed=57600
adafruit-atmega32u4-cat.upload.disable_flushing=true
adafruit-atmega32u4-cat.upload.use_1200bps_touch=true
adafruit-atmega32u4-cat.upload.wait_for_upload_port=true

adafruit-atmega32u4-cat.bootloader.path=caterina
adafruit-atmega32u4-cat.bootloader.tool=avrdude
adafruit-atmega32u4-cat.bootloader.low_fuses=0xff
adafruit-atmega32u4-cat.bootloader.high_fuses=0xd8
adafruit-atmega32u4-cat.bootloader.extended_fuses=0xcb

adafruit-atmega32u4-cat.build.mcu=atmega32u4
adafruit-atmega32u4-cat.build.f_cpu=16000000L
adafruit-atmega32u4-cat.build.vid=0x2341
adafruit-atmega32u4-cat.build.pid=0x8036
adafruit-atmega32u4-cat.build.usb_product="Arduino Leonardo"
adafruit-atmega32u4-cat.build.board=ADAFRUIT_ATMEGA32U4
adafruit-atmega32u4-cat.build.variant=adafruit/atmega32u4
adafruit-atmega32u4-cat.build.extra_flags={build.usb_flags}
adafruit-atmega32u4-cat.build.core=cosa

##
# ANARDUINO BOARDS
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
miniwireless.name=Cosa Anarduino MiniWireless (ATmega328/BOOT_168)
miniwireless.upload.tool=avrdude
miniwireless.upload.protocol=arduino
miniwireless.upload.maximum_size=30720
miniwireless.upload.maximum_data_size=2048
miniwireless.upload.maximum_eeprom_size=1024
miniwireless.upload.speed=57600

miniwireless.bootloader.tool=avrdude
miniwireless.bootloader.low_fuses=0xff
miniwireless.bootloader.high_fuses=0xda
miniwireless.bootloader.extended_fuses=0x05

miniwireless.build.mcu=atmega328p
miniwireless.build.f_cpu=16000000L
miniwireless.build.board=ANARDUINO_MINIWIRELESS
miniwireless.build.variant=anarduino/miniwireless
miniwireless.build.core=cosa

##
# ARDUINO BOARDS
##

# AVR:ATmega168
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x1c00). 
diecimila.name=Cosa Arduino Diecimila (ATmega168/BOOT_168)
diecimila.upload.tool=avrdude
diecimila.upload.protocol=arduino
diecimila.upload.maximum_size=14336
diecimila.upload.maximum_data_size=1024
diecimila.upload.maximum_eeprom_size=512
diecimila.upload.speed=19200

diecimila.bootloader.tool=avrdude
diecimila.bootloader.low_fuses=0xff
diecimila.bootloader.high_fuses=0xdd
diecimila.bootloader.extended_fuses=0x00

diecimila.build.mcu=atmega168
diecimila.build.f_cpu=16000000L
diecimila.build.board=ARDUINO_DIECIMILA
diecimila.build.variant=arduino/diecimila
diecimila.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
duemilanove.name=Cosa Arduino Duemilanove (ATmega328/BOOT_168)
duemilanove.upload.tool=avrdude
duemilanove.upload.protocol=arduino
duemilanove.upload.maximum_size=30720
duemilanove.upload.maximum_data_size=2048
duemilanove.upload.maximum_eeprom_size=1024
duemilanove.upload.speed=57600

duemilanove.bootloader.tool=avrdude
duemilanove.bootloader.low_fuses=0xff
duemilanove.bootloader.high_fuses=0xda
duemilanove.bootloader.extended_fuses=0x05

duemilanove.build.mcu=atmega328p
duemilanove.build.f_cpu=16000000L
duemilanove.build.board=ARDUINO_DUEMILANOVE
duemilanove.build.variant=arduino/duemilanove
duemilanove.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
leonardo.name=Cosa Arduino Leonardo (ATmega32U4/Caterina)
leonardo.upload.tool=avrdude
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.maximum_data_size=2560
leonardo.upload.maximum_eeprom_size=1024
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true
leonardo.upload.use_1200bps_touch=true
leonardo.upload.wait_for_upload_port=true

leonardo.bootloader.path=caterina
leonardo.bootloader.tool=avrdude
leonardo.bootloader.low_fuses=0xff
leonardo.bootloader.high_fuses=0xd8
leonardo.bootloader.extended_fuses=0xcb

leonardo.build.mcu=atmega32u4
leonardo.build.f_cpu=16000000L
leonardo.build.vid=0x2341
leonardo.build.pid=0x8036
leonardo.build.usb_product="Arduino Leonardo"
leonardo.build.board=ARDUINO_LEONARDO
leonardo.build.variant=arduino/leonardo
leonardo.build.extra_flags={build.usb_flags}
leonardo.build.core=cosa

# AVR:ATmega1280
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0xf800). 
mega1280.name=Cosa Arduino Mega (ATmega1280/BOOT_168)
mega1280.upload.tool=avrdude
mega1280.upload.protocol=arduino
mega1280.upload.maximum_size=126976
mega1280.upload.maximum_data_size=8192
mega1280.upload.maximum_eeprom_size=4096
mega1280.upload.speed=57600

mega1280.bootloader.tool=avrdude
mega1280.bootloader.low_fuses=0xff
mega1280.bootloader.high_fuses=0xda
mega1280.bootloader.extended_fuses=0xf5

