mikaelpatel/Cosa/boards.txt
mega1280.build.mcu=atmega1280
mega1280.build.f_cpu=16000000L
mega1280.build.board=ARDUINO_MEGA1280
mega1280.build.variant=arduino/mega1280
mega1280.build.core=cosa

# AVR:ATmega2560
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (4096 words, 0x1f000). 
mega2560.name=Cosa Arduino Mega (ATmega2560/STK500v2)
mega2560.upload.tool=avrdude
mega2560.upload.protocol=wiring
mega2560.upload.maximum_size=253952
mega2560.upload.maximum_data_size=8192
mega2560.upload.maximum_eeprom_size=4096
mega2560.upload.speed=115200

mega2560.bootloader.tool=avrdude
mega2560.bootloader.low_fuses=0xff
mega2560.bootloader.high_fuses=0xd8
mega2560.bootloader.extended_fuses=0xfd

mega2560.build.mcu=atmega2560
mega2560.build.f_cpu=16000000L
mega2560.build.board=ARDUINO_MEGA2560
mega2560.build.variant=arduino/mega2560
mega2560.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
micro.name=Cosa Arduino Micro (ATmega32U4/Caterina)
micro.upload.tool=avrdude
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.maximum_eeprom_size=1024
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

micro.bootloader.path=caterina
micro.bootloader.tool=avrdude
micro.bootloader.low_fuses=0xff
micro.bootloader.high_fuses=0xd8
micro.bootloader.extended_fuses=0xcb

micro.build.mcu=atmega32u4
micro.build.f_cpu=16000000L
micro.build.vid=0x2341
micro.build.pid=0x8037
micro.build.usb_product="Arduino Micro"
micro.build.board=ARDUINO_MICRO
micro.build.variant=arduino/micro
micro.build.extra_flags={build.usb_flags}
micro.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
nano.name=Cosa Arduino Nano (ATmega328/BOOT_168)
nano.upload.tool=avrdude
nano.upload.protocol=arduino
nano.upload.maximum_size=30720
nano.upload.maximum_data_size=2048
nano.upload.maximum_eeprom_size=1024
nano.upload.speed=57600

nano.bootloader.tool=avrdude
nano.bootloader.low_fuses=0xff
nano.bootloader.high_fuses=0xda
nano.bootloader.extended_fuses=0x05

nano.build.mcu=atmega328p
nano.build.f_cpu=16000000L
nano.build.board=ARDUINO_NANO
nano.build.variant=arduino/nano
nano.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
pro-micro.name=Cosa Arduino Pro Micro (ATmega32U4/Caterina)
pro-micro.upload.tool=avrdude
pro-micro.upload.protocol=avr109
pro-micro.upload.maximum_size=28672
pro-micro.upload.maximum_data_size=2560
pro-micro.upload.maximum_eeprom_size=1024
pro-micro.upload.speed=57600
pro-micro.upload.disable_flushing=true
pro-micro.upload.use_1200bps_touch=true
pro-micro.upload.wait_for_upload_port=true

pro-micro.bootloader.path=caterina
pro-micro.bootloader.tool=avrdude
pro-micro.bootloader.low_fuses=0xff
pro-micro.bootloader.high_fuses=0xd8
pro-micro.bootloader.extended_fuses=0xcb

pro-micro.build.mcu=atmega32u4
pro-micro.build.f_cpu=16000000L
pro-micro.build.vid=0x2341
pro-micro.build.pid=0x8037
pro-micro.build.usb_product="Arduino Pro Micro"
pro-micro.build.board=ARDUINO_PRO_MICRO
pro-micro.build.variant=arduino/pro-micro
pro-micro.build.extra_flags={build.usb_flags}
pro-micro.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.=8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
pro-micro-8.name=Cosa Arduino Pro Micro (ATmega32U4/Caterina, 3.3V, 8 MHz)
pro-micro-8.upload.tool=avrdude
pro-micro-8.upload.protocol=avr109
pro-micro-8.upload.maximum_size=28672
pro-micro-8.upload.maximum_data_size=2560
pro-micro-8.upload.maximum_eeprom_size=1024
pro-micro-8.upload.speed=57600
pro-micro-8.upload.disable_flushing=true
pro-micro-8.upload.use_1200bps_touch=true
pro-micro-8.upload.wait_for_upload_port=true

pro-micro-8.bootloader.path=caterina
pro-micro-8.bootloader.tool=avrdude
pro-micro-8.bootloader.low_fuses=0xff
pro-micro-8.bootloader.high_fuses=0xd8
pro-micro-8.bootloader.extended_fuses=0xcb

pro-micro-8.build.mcu=atmega32u4
pro-micro-8.build.f_cpu=8000000L
pro-micro-8.build.vid=0x2341
pro-micro-8.build.pid=0x8037
pro-micro-8.build.usb_product="Arduino Pro Micro"
pro-micro-8.build.board=ARDUINO_PRO_MICRO
pro-micro-8.build.variant=arduino/pro-micro
pro-micro-8.build.extra_flags={build.usb_flags}
pro-micro-8.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
pro-mini.name=Cosa Arduino Pro Mini (ATmega328/BOOT_168)
pro-mini.upload.tool=avrdude
pro-mini.upload.protocol=arduino
pro-mini.upload.maximum_size=30720
pro-mini.upload.maximum_data_size=2048
pro-mini.upload.maximum_eeprom_size=1024
pro-mini.upload.speed=57600

pro-mini.bootloader.tool=avrdude
pro-mini.bootloader.low_fuses=0xff
pro-mini.bootloader.high_fuses=0xda
pro-mini.bootloader.extended_fuses=0x05

pro-mini.build.mcu=atmega328p
pro-mini.build.f_cpu=16000000L
pro-mini.build.board=ARDUINO_PRO_MINI
pro-mini.build.variant=arduino/pro-mini
pro-mini.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
pro-mini-8.name=Cosa Arduino Pro Mini (ATmega328/BOOT_168, 3.3V, 8 MHz)
pro-mini-8.upload.tool=avrdude
pro-mini-8.upload.protocol=arduino
pro-mini-8.upload.maximum_size=30720
pro-mini-8.upload.maximum_data_size=2048
pro-mini-8.upload.maximum_eeprom_size=1024
pro-mini-8.upload.speed=57600

pro-mini-8.bootloader.tool=avrdude
pro-mini-8.bootloader.low_fuses=0xFF
pro-mini-8.bootloader.high_fuses=0xDA
pro-mini-8.bootloader.extended_fuses=0x05

